# Data Preparation:

### Merging:

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'],
... 'price': [12.33,11.44,33.21,13.23,33.62]})

In [4]:
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [6]:
frame2 = pd.DataFrame( {'id':['pencil','pencil','ball','pen'],
... 'color': ['white','red','red','black']})

In [7]:
frame2

       id  color
0  pencil  white
1  pencil    red
2    ball    red
3     pen  black

Carry out the merging applying the __merge__ function to the two DataFrame objects

In [10]:
pd.merge(frame1, frame2)

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

The returned DataFrame consistes of all rows that have the an __ID__ in common between the two DataFrames.   
In this case we used the the __merge()__ function without specifying any column explicitly.   
In fact, in most cases you need to decide which is the column on which to base the merging.  
__To do this, add the __(on)__ option with the column name as the key for the merging$__

In [24]:
frame1 = pd.DataFrame( {'brand': ['OMG','ABC','ABC','POD','POD'],
... 'color': ['white','red','red','black','green'],
... 'id':['ball','pencil','pen','mug','ashtray']})

In [25]:
frame2 = pd.DataFrame( {'brand': ['OMG','POD','ABC','POD'],
    'id':['pencil','pencil','ball','pen']})
...

Ellipsis

In [26]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [23]:
frame2

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

Now in this case you have two DataFrame having columns with the same name. So, if you launch a merging you do not get any resulte...

In [27]:
pd.merge(frame1, frame2)

Empty DataFrame
Columns: [brand, color, id]
Index: []

So it is necessary to explicitly define the criterion of merging that pandas must follow, specifying the name of the key column in the (on) option.

In [28]:
pd.merge(frame1, frame2, on = 'id')

  brand_x  color      id brand_y
0     OMG  white    ball     ABC
1     ABC    red  pencil     OMG
2     ABC    red  pencil     POD
3     ABC    red     pen     POD

In [29]:
pd.merge(frame1, frame2, on = 'brand')

  brand  color     id_x    id_y
0   OMG  white     ball  pencil
1   ABC    red   pencil    ball
2   ABC    red      pen    ball
3   POD  black      mug  pencil
4   POD  black      mug     pen
5   POD  green  ashtray  pencil
6   POD  green  ashtray     pen

As expected the result vary considerably depending on the criteria of merging.   
Often, however, the opposite problem arises, that is, to have two DataFrame in which the key columns do not have the same name.   
To remedy this situation, you have to use the __left_on__ and __right_on__ options that specify the key column for the first and for the second DataFrame.

In [30]:
frame2.columns = ['brand', 'sid']

In [31]:
frame2

  brand     sid
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [32]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [35]:
pd.merge(frame1, frame2, left_on = 'id', right_on = 'sid')

  brand_x  color      id brand_y     sid
0     OMG  white    ball     ABC    ball
1     ABC    red  pencil     OMG  pencil
2     ABC    red  pencil     POD  pencil
3     ABC    red     pen     POD     pen

By default, the __merge()__ function performs an __inner join__, the keys in the result are the result of an intersection.   

Other possible options are the __left join__, the __right join__. The outer join produces the union of all keys, combining the effect of a left join with a right join. To select the type of join you have to use the __how__ option.

In [46]:
frame2

  brand     sid
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [48]:
frame2.columns =['brand', 'id']

In [49]:
frame2

  brand      id
0   OMG  pencil
1   POD  pencil
2   ABC    ball
3   POD     pen

In [42]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

Other possible options are the __left join__, the __right join__. The outer join produces the union of all keys, combining the effect of a left join with a right join. To select the type of join you have to use the __how__ option.

In [51]:
pd.merge(frame1, frame2, on='id')

  brand_x  color      id brand_y
0     OMG  white    ball     ABC
1     ABC    red  pencil     OMG
2     ABC    red  pencil     POD
3     ABC    red     pen     POD

In [50]:
pd.merge(frame1, frame2, on='id', how='outer')

  brand_x  color       id brand_y
0     POD  green  ashtray     NaN
1     OMG  white     ball     ABC
2     POD  black      mug     NaN
3     ABC    red      pen     POD
4     ABC    red   pencil     OMG
5     ABC    red   pencil     POD

In [52]:
pd.merge(frame1, frame2, on='id', how='left')

  brand_x  color       id brand_y
0     OMG  white     ball     ABC
1     ABC    red   pencil     OMG
2     ABC    red   pencil     POD
3     ABC    red      pen     POD
4     POD  black      mug     NaN
5     POD  green  ashtray     NaN

In [53]:
pd.merge(frame1, frame2, on='id', how='right')

  brand_x  color      id brand_y
0     ABC    red  pencil     OMG
1     ABC    red  pencil     POD
2     OMG  white    ball     ABC
3     ABC    red     pen     POD

To make the merge of multiple keys, you simply just add a list to the __on__ option

In [55]:
pd.merge(frame1, frame2, on=['id', 'brand'], how='outer')

  brand  color       id
0   POD  green  ashtray
1   ABC    NaN     ball
2   OMG  white     ball
3   POD  black      mug
4   ABC    red      pen
5   POD    NaN      pen
6   ABC    red   pencil
7   OMG    NaN   pencil
8   POD    NaN   pencil

### Merging on Index
In some cases, instead of considering the columns of a DataFrame as Keys, the indexes could be used as keys on which to make the criteria for merging. Then in order to decide which indexes to consider, set the __left_index__ or __right_index__ options to True to activate them, with the ability to activate them both.

In [56]:
pd.merge(frame1, frame2, right_index=True, left_index=True)

  brand_x  color    id_x brand_y    id_y
0     OMG  white    ball     OMG  pencil
1     ABC    red  pencil     POD  pencil
2     ABC    red     pen     ABC    ball
3     POD  black     mug     POD     pen

But the DataFrame objects have a __join()__ function which is much more convenient when you want to do the merging by indexes. It also be used to combine many DataFrame objects having the same or the same indexes but with columns not overlapping.   
In fact, if you launch $frame1.join(fram2)$ you will get an error because some columns of the frame1 have the same name of frame2. Then rename the columns of frame2 before launching the $join()$ function.

In [58]:
frame2.columns=['brand2','id2']

In [59]:
frame2

  brand2     id2
0    OMG  pencil
1    POD  pencil
2    ABC    ball
3    POD     pen

In [60]:
frame1

  brand  color       id
0   OMG  white     ball
1   ABC    red   pencil
2   ABC    red      pen
3   POD  black      mug
4   POD  green  ashtray

In [61]:
frame1.join(frame2)

  brand  color       id brand2     id2
0   OMG  white     ball    OMG  pencil
1   ABC    red   pencil    POD  pencil
2   ABC    red      pen    ABC    ball
3   POD  black      mug    POD     pen
4   POD  green  ashtray    NaN     NaN

### Concatinating:
Another type of Data combination is referred as __Concatenation__. NumPy provides a __concatenate()__ function to do this kind of operation with arrays.

In [63]:
import numpy as np

In [65]:
array1 = np.array([[0,1,2],[3,4,5],[6,7,8]])

In [66]:
array1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [67]:
array2 = np.arange(9).reshape((3,3))+6

In [68]:
array2

array([[ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [69]:
np.concatenate([array1, array2], axis=1) # horizontal

array([[ 0,  1,  2,  6,  7,  8],
       [ 3,  4,  5,  9, 10, 11],
       [ 6,  7,  8, 12, 13, 14]])

In [70]:
np.concatenate([array1,array2], axis=0) # vertical

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

As regards the pandas liberary and its data structures like Series, and DataFrame, the fact of having labeled axes allows you to further generalize the concatenation of arrays. The __concat()__ function is provided by pandas for this kind of operations.

In [74]:
ser1 = pd.Series(np.random.rand(4), index=[1,2,3,4])
ser2 = pd.Series(np.random.rand(4), index=[5,6,7,8])

In [75]:
ser1

1    0.595462
2    0.387115
3    0.816738
4    0.697786
dtype: float64

In [76]:
ser2

5    0.246560
6    0.378661
7    0.431663
8    0.416904
dtype: float64

In [82]:
pd.concat([ser1,ser2])

1    0.595462
2    0.387115
3    0.816738
4    0.697786
5    0.246560
6    0.378661
7    0.431663
8    0.416904
dtype: float64

By default, the concat() function works on axis=0, having as returned object a Series.If you set the axis=1, then the result will be a DataFram

In [83]:
pd.concat([ser1,ser2], axis=1)

          0         1
1  0.595462       NaN
2  0.387115       NaN
3  0.816738       NaN
4  0.697786       NaN
5       NaN  0.246560
6       NaN  0.378661
7       NaN  0.431663
8       NaN  0.416904

From the result you can see that there is no overlap of data, therefore what you have just done is an __outer__ join. This can be changed by setting the __join__ option to __inner__

In [86]:
pd.concat([ser1,ser2], axis=1, keys=[1,2])

          1         2
1  0.595462       NaN
2  0.387115       NaN
3  0.816738       NaN
4  0.697786       NaN
5       NaN  0.246560
6       NaN  0.378661
7       NaN  0.431663
8       NaN  0.416904

In the case of combination between Series along the axis=1 the keys become the column headers of the DataFrame  like the cell above.

So far you have seen the concatenation applied to the Series, but the same logic can be applied to the DataFrame.

In [87]:
frame1 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[1,2,3], 
                      columns=['A', 'B', 'C'] )

In [89]:
frame2 = pd.DataFrame(np.random.rand(9).reshape(3,3),index=[4,5,6],
                     columns=['A','B','C'])

In [90]:
frame1

          A         B         C
1  0.261383  0.465485  0.668583
2  0.740957  0.319309  0.729763
3  0.627557  0.846950  0.432960

In [91]:
frame2

          A         B         C
4  0.856311  0.383396  0.417120
5  0.839470  0.418393  0.170149
6  0.971571  0.928921  0.086505

In [95]:
pd.concat([frame1, frame2]) # vertical

          A         B         C
1  0.261383  0.465485  0.668583
2  0.740957  0.319309  0.729763
3  0.627557  0.846950  0.432960
4  0.856311  0.383396  0.417120
5  0.839470  0.418393  0.170149
6  0.971571  0.928921  0.086505

In [97]:
pd.concat([frame1,frame2], axis=1) # horizontal

          A         B         C         A         B         C
1  0.261383  0.465485  0.668583       NaN       NaN       NaN
2  0.740957  0.319309  0.729763       NaN       NaN       NaN
3  0.627557  0.846950  0.432960       NaN       NaN       NaN
4       NaN       NaN       NaN  0.856311  0.383396  0.417120
5       NaN       NaN       NaN  0.839470  0.418393  0.170149
6       NaN       NaN       NaN  0.971571  0.928921  0.086505

### Combining
There is another situation in which there is combination of data that can not be obtained either with merging or with concatenation. Take the case in which you want two datasets to have indexes that overlap in their entirety or at least partially.  
One applicable function to Series is __combine_first()__, function which performs this kind of operation along with an data alignment.

In [98]:
ser1 = pd.Series(np.random.rand(5),index=[1,2,3,4,5])

In [99]:
ser2 = pd.Series(np.random.rand(4),index=[2,4,5,6])

In [100]:
ser1

1    0.798706
2    0.014931
3    0.212070
4    0.178498
5    0.851400
dtype: float64

In [101]:
ser2

2    0.166745
4    0.606091
5    0.803013
6    0.751883
dtype: float64

In [102]:
ser1.combine_first(ser2)

1    0.798706
2    0.014931
3    0.212070
4    0.178498
5    0.851400
6    0.751883
dtype: float64

In [103]:
ser2.combine_first(ser1)

1    0.798706
2    0.166745
3    0.212070
4    0.606091
5    0.803013
6    0.751883
dtype: float64

Here the function combined the both Series and compensate each index by its corresponding value based on the (index) parameters given in the creation code line ...

Instead, if you want a partial overlap, you can specify only the portion of the Series you want to overlap.

In [104]:
ser1[:3].combine_first(ser2[:3])

1    0.798706
2    0.014931
3    0.212070
4    0.606091
5    0.803013
dtype: float64

### Pivoting
In addittion to assembling data in order to unify the values collecting from different sources, another fairly common operation is __pivoting__.   
In fact, arrangement of the values by row or by column is not always suited to your goals.   
Sometimes you would like to rearrange the data carrying column values on rows or vice versa.  
### Pivoting with Hierarical Indexing:
You have already seen that DataFrame can support hierarical indexing. This feature can be exploited to rearrange the data in DataFrame. In the context of pivoting you have two basic operations.   
   stacking: columns to rows  
   unstacking: rows to columns

In [105]:
import os

In [107]:
from pandas import ExcelWriter

In [109]:
import seaborn as sns

In [120]:
os.path.isfile('worldcities.csv')

True

In [123]:
my_file = pd.read_csv('worldcities.csv')

In [124]:
my_file

                      City                   Country
0                Rovaniemi                   Finland
1                Steinkjer                    Norway
2                 Monterey  United States of America
3                     Kuta                 Indonesia
4                    Lovec                  Bulgaria
...                    ...                       ...
7317                De Aar              South Africa
7318  Kamensk Shakhtinskiy                    Russia
7319                 Sinop                    Turkey
7320              Tirupati                     India
7321              Huangshi                     China

[7322 rows x 2 columns]

In [126]:
my_file.stack() #pivoting the columns in rows producing Series

0     City       Rovaniemi
      Country      Finland
1     City       Steinkjer
      Country       Norway
2     City        Monterey
                   ...
7319  Country       Turkey
7320  City        Tirupati
      Country        India
7321  City        Huangshi
      Country        China
Length: 14644, dtype: object

From this hierarically indexed series, you can reassemble the DataFrame into a pivoted table by use  __unstack()__ function.

In [127]:
my_file.unstack()

City     0          Rovaniemi
         1          Steinkjer
         2           Monterey
         3               Kuta
         4              Lovec
                     ...
Country  7317    South Africa
         7318          Russia
         7319          Turkey
         7320           India
         7321           China
Length: 14644, dtype: object

You can also do the unstack on a different level, specifying the number of the levels or its name as the argument of the function.

In [130]:
my_file.unstack(0)

City     0          Rovaniemi
         1          Steinkjer
         2           Monterey
         3               Kuta
         4              Lovec
                     ...
Country  7317    South Africa
         7318          Russia
         7319          Turkey
         7320           India
         7321           China
Length: 14644, dtype: object

### Pivoting from "Long" to "Wide" Format:
The most common way to store data sets is produced by the punctual registration of data that will fill a line of the text file, for example, CSV, or a table of a database. This happens especially when you have instrumental readings, calculation results iterated overtime, or the simple manual input of a series of values.  
A similar case of these files is for example the logs file, which is filled line by line by accumulating data in it.   

The peculiar characteristic of this type of dataset is to have entries on various columns, often duplicated in subsequent lines.   

Always remaining in tabular format of data, when you are in such cases you can refer them to as __long__ or __stack__ format.

In [150]:
my_file

                      City                   Country
0                Rovaniemi                   Finland
1                Steinkjer                    Norway
2                 Monterey  United States of America
3                     Kuta                 Indonesia
4                    Lovec                  Bulgaria
...                    ...                       ...
7317                De Aar              South Africa
7318  Kamensk Shakhtinskiy                    Russia
7319                 Sinop                    Turkey
7320              Tirupati                     India
7321              Huangshi                     China

[7322 rows x 2 columns]

In [157]:
wideframe = my_file.pivot(columns = 'Country')

In [158]:
wideframe

               City                                                      \
Country Afghanistan Aland Albania Algeria American Samoa Andorra Angola
0               NaN   NaN     NaN     NaN            NaN     NaN    NaN
1               NaN   NaN     NaN     NaN            NaN     NaN    NaN
2               NaN   NaN     NaN     NaN            NaN     NaN    NaN
3               NaN   NaN     NaN     NaN            NaN     NaN    NaN
4               NaN   NaN     NaN     NaN            NaN     NaN    NaN
...             ...   ...     ...     ...            ...     ...    ...
7317            NaN   NaN     NaN     NaN            NaN     NaN    NaN
7318            NaN   NaN     NaN     NaN            NaN     NaN    NaN
7319            NaN   NaN     NaN     NaN            NaN     NaN    NaN
7320            NaN   NaN     NaN     NaN            NaN     NaN    NaN
7321            NaN   NaN     NaN     NaN            NaN     NaN    NaN

                                                  ...                     \
Country Antarctica Antigua and Barbuda Argentina  ... Uruguay Uzbekistan
0              NaN                 NaN       NaN  ...     NaN        NaN
1              NaN                 NaN       NaN  ...     NaN        NaN
2              NaN                 NaN       NaN  ...     NaN        NaN
3              NaN                 NaN       NaN  ...     NaN        NaN
4              NaN                 NaN       NaN  ...     NaN        NaN
...            ...                 ...       ...  ...     ...        ...
7317           NaN                 NaN       NaN  ...     NaN        NaN
7318           NaN                 NaN       NaN  ...     NaN        NaN
7319           NaN                 NaN       NaN  ...     NaN        NaN
7320           NaN                 NaN       NaN  ...     NaN        NaN
7321           NaN                 NaN       NaN  ...     NaN        NaN

                                                                           \
Country Vanuatu Vatican (Holy Sea) Venezuela Vietnam Western Sahara Yemen
0           NaN                NaN       NaN     NaN            NaN   NaN
1           NaN                NaN       NaN     NaN            NaN   NaN
2           NaN                NaN       NaN     NaN            NaN   NaN
3           NaN                NaN       NaN     NaN            NaN   NaN
4           NaN                NaN       NaN     NaN            NaN   NaN
...         ...                ...       ...     ...            ...   ...
7317        NaN                NaN       NaN     NaN            NaN   NaN
7318        NaN                NaN       NaN     NaN            NaN   NaN
7319        NaN                NaN       NaN     NaN            NaN   NaN
7320        NaN                NaN       NaN     NaN            NaN   NaN
7321        NaN                NaN       NaN     NaN            NaN   NaN


Country Zambia Zimbabwe
0          NaN      NaN
1          NaN      NaN
2          NaN      NaN
3          NaN      NaN
4          NaN      NaN
...        ...      ...
7317       NaN      NaN
7318       NaN      NaN
7319       NaN      NaN
7320       NaN      NaN
7321       NaN      NaN

[7322 rows x 223 columns]

This mode of data recording, however, has some disadventages.  
One for example, is prcisely the multiplicity and repetation of some fields. considering the columns as keys, the data with this format will be difficult  to read, especially in fully understanding the relationships between the key values and the rest of the columns.   

Instead of the long format, there is another way to arrange the data in a table that is called __wide__.  
this mode is easier to read, allowing easy connection with other tables, and it occupies much less space. So in general it is more effecient way of storing data, although less practical, especially if during the filling of the data.   

As a criterion, select a column, or a set of them, as the primary key; then, the values contained in it must be unique.   

In this regard, pandas gives you a function that allows to make a transformation of DataFrame from the long type to the wide type. This function is __pivot()__ and it accepts as arguments the column or columns, which will assume the role of key.   

Starting from the previous example you choose to create a DataFrame in wide format by choosing thecolor column as the key, and item as a second key, the values of which will form the new columns of thedata frame.

In [140]:
longframe = pd.DataFrame({ 'color':['white','white','white',
... 'red','red','red',
... 'black','black','black'],
... 'item':['ball','pen','mug',
... 'ball','pen','mug',
... 'ball','pen','mug'],
... 'value': np.random.rand(9)})

In [141]:
longframe

   color  item     value
0  white  ball  0.740352
1  white   pen  0.751723
2  white   mug  0.345651
3    red  ball  0.073299
4    red   pen  0.713923
5    red   mug  0.538910
6  black  ball  0.680800
7  black   pen  0.476723
8  black   mug  0.619757

In [148]:
wideframe = longframe.pivot(columns = 'item')

In [149]:
wideframe

      color                   value
item   ball    mug    pen      ball       mug       pen
0     white    NaN    NaN  0.740352       NaN       NaN
1       NaN    NaN  white       NaN       NaN  0.751723
2       NaN  white    NaN       NaN  0.345651       NaN
3       red    NaN    NaN  0.073299       NaN       NaN
4       NaN    NaN    red       NaN       NaN  0.713923
5       NaN    red    NaN       NaN  0.538910       NaN
6     black    NaN    NaN  0.680800       NaN       NaN
7       NaN    NaN  black       NaN       NaN  0.476723
8       NaN  black    NaN       NaN  0.619757       NaN

### Removing
The last stage of data preparation is the removal of columns and rows. you have already seen this part. However, for completeness, the describtion here.

In [168]:
my_file = pd.read_csv('worldcities.csv')

In [169]:
my_file

                      City                   Country
0                Rovaniemi                   Finland
1                Steinkjer                    Norway
2                 Monterey  United States of America
3                     Kuta                 Indonesia
4                    Lovec                  Bulgaria
...                    ...                       ...
7317                De Aar              South Africa
7318  Kamensk Shakhtinskiy                    Russia
7319                 Sinop                    Turkey
7320              Tirupati                     India
7321              Huangshi                     China

[7322 rows x 2 columns]

In order to remove a column, you have to simply use the __del__ command applied to the DataFrame with the column name specified.

In [171]:
del my_file ['City']

In [172]:
my_file

                       Country
0                      Finland
1                       Norway
2     United States of America
3                    Indonesia
4                     Bulgaria
...                        ...
7317              South Africa
7318                    Russia
7319                    Turkey
7320                     India
7321                     China

[7322 rows x 1 columns]

In [176]:
World_Cities = pd.read_csv('worldcities.csv')

In [177]:
World_Cities

                      City                   Country
0                Rovaniemi                   Finland
1                Steinkjer                    Norway
2                 Monterey  United States of America
3                     Kuta                 Indonesia
4                    Lovec                  Bulgaria
...                    ...                       ...
7317                De Aar              South Africa
7318  Kamensk Shakhtinskiy                    Russia
7319                 Sinop                    Turkey
7320              Tirupati                     India
7321              Huangshi                     China

[7322 rows x 2 columns]

Instead, to remove an unwanted row, you have to use __drop()__  function with the label of the corresponding index as argument.

In [180]:
my_file.drop([4]) # removed the 'Bulgaria' indexed [4]

                       Country
0                      Finland
1                       Norway
2     United States of America
3                    Indonesia
5                       Canada
...                        ...
7317              South Africa
7318                    Russia
7319                    Turkey
7320                     India
7321                     China

[7321 rows x 1 columns]


   




# Data Transformation
### Removing Duplicates
### Mapping
### Replacing values via Mapping
### Adding values via Mapping
### Renaming the Indexes of the Axes
# Discretization and Binning
### Detecting and Filtering Outliers
# Permutation
### Random Sampling
# String Manipulation
### Built-in Methods for Manipulation of Strings
### Regular Expressions
# Data Aggrigation
### GroupBy
### Hierarical Grouping
# Group Iteration
### Chain of Transformation
### Functions of Groups
# Advanced Data Aggregation
# Conclusions